# Creating Databases and Tables

### Startup

`mysql-ctl cli` - Start the CLI

### Create Database

You can have individual 'walled off' databases within a 'Database Server.' Generally, people capitalize what comes from SQL vs what does not

`show databases;` - list the current datacases that exist within the MySQL server    
`CREATE DATABASE <name>;` - the general command for creating a database

### Delete Database

`DROP DATABASE <name>;` - delete database

### Using Databases

`USE <database name>;` - change database for usage
`SELECT database():` - echo current database

### Basic Datatypes

Columns cannot have mixed datatypes. Example of types:    

Numeric:   
- **INT** - Whole number, max value of 4294967295
- SMALLINT
- FLOAT
- DOUBLE ....

String Types:
- **VARCHAR** - a Variable-Length String between 1 and 255 characters
- TEXT
- BLOB
- ENUM ....

Date Types:
- DATE
- DATETIME
- TIMESTAMP
- YEAR ....

### Tables

A database is just a bunch of tables (in a relational database). Tables are collection of related data held in a structured format within a database. Consists of columns (header) and rows (data). 

### Creating Tables

`CREATE TABLE <tablename>
    (
        column_name data_type,
        column_name data_type
    );`


### Table Commands (Describe)
`SHOW TABLES;` - show tables in current database  
`SHOW COLUMNS FROM <tablename>;` - show columns from defined table   
`DESC <tablename>;` - similar to the above, describe table  

### Delete Tables
`DROP TABLE <tablename>;` - delete table

### Inserting Data


`INSERT INTO table_name(column_name) 
VALUES (data);`

`INSERT INTO dogs(name, age)
VALUES ('Kiba', 10);`

#### Multiple inserts:

`INSERT INTO table_name 
            (column_name, column_name) 
VALUES      (value, value), 
            (value, value), 
            (value, value);`

### Warnings
Immediately after command    
`SHOW WARNINGS;`

### NULL and NOT_NULL
NULL "The value is not known"

`CREATE TABLE cats2
  (
    name VARCHAR(100) NOT NULL,
    age INT NOT NULL
  );`

### Default Values

Define a table with a DEFAULT name specified:

`CREATE TABLE cats3
  (
    name VARCHAR(20) DEFAULT 'no name provided',
    age INT DEFAULT 99
  );`
  
Combine NOT NULL and DEFAULT:

`CREATE TABLE cats4
  (
    name VARCHAR(20) NOT NULL DEFAULT 'unnamed',
    age INT NOT NULL DEFAULT 99
  );`

### Primary Keys

Primary Key - A unique identifier

Define a table with a PRIMARY KEY constraint and auto increment:

`CREATE TABLE unique_cats2 (
    cat_id INT NOT NULL AUTO_INCREMENT,
    name VARCHAR(100),
    age INT,
    PRIMARY KEY (cat_id)
);`

In [ ]:
QUIZ
CREATE TABLE employees (
    id INT AUTO_INCREMENT NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    first_name VARCHAR(255) NOT NULL,
    middle_name VARCHAR(255),
    age INT NOT NULL,
    current_status VARCHAR(255) NOT NULL DEFAULT 'employed',
    PRIMARY KEY (id)
);

# CRUD Commands
Create Read Update Delete

## Read

### Select
SELECT - what columns do you want?

`SELECT * FROM <table>;`   
`SELECT column1, column2 FROM <table>;`    

### Where
Note: case-insensitive by default

`SELECT * FROM <table> WHERE column1=value;`    
`SELECT cat_id, age FROM cats WHERE cat_id=age;`    

### Alias

`SELECT cat_id AS id, name FROM cats;`

## Update

### Update and Set
Hint: use SELECT before UPDATE to test query

`UPDATE <table> SET columnX=<valuex>
WHERE columnX=<valuex>;`

`UPDATE cats SET breed='Shorthair'
WHERE breed='Tabby';`

## DELETE
(or destroy)

### DELETE

`DELETE FROM <table> WHERE column=<value>`        
`DELETE FROM cats WHERE name='Egg';`

# Running SQL files 

`source <path/filename.sql>`

# String Functions

### CONCAT
SELECT
  CONCAT(author_fname, ' ', author_lname)
FROM books;

SELECT author_fname AS first, author_lname AS last, 
  CONCAT(author_fname, ', ', author_lname) AS full
FROM books;

### CONCAT_WS

SELECT 
    CONCAT_WS(' - ', title, author_fname, author_lname) 
FROM books;

### SUBSTRING
mySQL indices start at 1

`SELECT SUBSTRING('Hello World', 1, 4);  -> Hell`   
`SELECT SUBSTRING('Hello World', 7);  -> World`   
`SELECT SUBSTRING('Hello World', -3);  -> rld`   

`SELECT CONCAT
    (
        SUBSTRING(title, 1, 10),
        '...'
    ) AS 'short title'
FROM books;`

### REPLACE
SELECT REPLACE('Hello World', 'l', '7');

SELECT
  REPLACE('cheese bread coffee milk', ' ', ' and ');
 
SELECT
    SUBSTRING(REPLACE(title, 'e', '3'), 1, 10) AS 'weird string'
FROM books;

### REVERSE

`SELECT REVERSE('Hello World');`
`SELECT CONCAT(author_fname, REVERSE(author_fname)) FROM books;`

### CHAR LENGTH

`SELECT CHAR_LENGTH('Hello World');`    
`SELECT CONCAT(author_lname, ' is ', CHAR_LENGTH(author_lname), ' characters long') FROM books;`   

### UPPER() and LOWER()

`SELECT UPPER('Hello World');`    
`SELECT CONCAT('MY FAVORITE BOOK IS ', UPPER(title)) FROM books;`

# Refining Our Selections

### DISTINCT

`SELECT DISTINCT <column> FROM <table>;`   
`SELECT DISTINCT author_fname, author_lname FROM books;`

### ORDER BY
`SELECT title FROM books ORDER BY title;`   
`SELECT title, released_year, pages FROM books ORDER BY released_year;`     
`SELECT title, author_fname, author_lname FROM books ORDER BY 1 DESC;` 

### LIMIT
Row is 0th row, but string start with index 1.

`SELECT title FROM books LIMIT 3;`

`SELECT title, released_year FROM books
ORDER BY released_year DESC LIMIT 0,5;`

### LIKE
Note: % is wildcard of any size. _ is wildcard of specific size (e.g. __ is 2 characters)
Escape character \ if you need to match % or _ 

`SELECT * FROM books WHERE author_fname LIKE 'da%';`   
`SELECT title, stock_quantity FROM books WHERE stock_quantity LIKE '____';`

# Aggregate Functions

### COUNT

`SELECT COUNT(*) FROM <table>;`   
`SELECT COUNT(DISTINCT author_lname, author_fname) FROM books;`

### GROUP BY
GROUP BY summarizes or aggregates identical data into single rows.
Aggregate - a whole formed by combining several (typically disparate) elements.

`SELECT title, author_fname, author_lname FROM books GROUP BY author_lname;`   
`SELECT author_fname, author_lname, COUNT(*) FROM books GROUP BY author_lname, author_fname;`    
`SELECT CONCAT('In ', released_year, ' ', COUNT(*), ' book(s) released') AS year FROM books GROUP BY released_year;`

### MIN & MAX

`SELECT MIN(released_year) FROM books;`   
`SELECT MAX(released_year) FROM books;`

Does not work, since MAX(released_year) provide 1 slot, title just puts first title
`SELECT MAX(released_year), titles FROM books;`

Option 1 - subquery
`SELECT * FROM books
WHERE pages = (SELECT MAX(pages) FROM books);`

Option 2 - ORDER BY (faster)
`SELECT title, pages FROM books
ORDER BY pages ASC LIMIT 1;`

### MIN MAX with GROUP BY

`SELECT author_fname, author_lname, MIN(released_year)
FROM books
GROUP BY author_lname, author_fname;`  

### SUM
`SELECT SUM(pages) FROM books;`  
`SELECT author_fname, author_lname, SUM(pages)
FROM books
GROUP BY author_lname, author_fname;`

### AVG
`SELECT AVG(released_year) FROM books;`  
`SELECT released_year, AVG(stock_quantity) 
FROM books 
GROUP BY released_year;`

# Data Types

### Storing Strings / Text

* VARCHAR - variable length, better for strings with variation (e.g. Male, Female), lower storage   
* CHAR - has a fixed length (0 to 255). Right padded with spaces to the specified length.
    - faster for fixed length text (e.g. CA, NY)